БухЭксп/InformationRegisters/CW_СостояниеСогласованияОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СостояниеСогласованияОбъекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОповещенияКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОповещенияКОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОповещения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СобытияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СобытияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокСогласованияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокСогласованияОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Параллельное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Последовательное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭтапыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭтапыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокСогласованияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеЗавершение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаршрутСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаСогласования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_СобытияСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замечания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получено</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаетСогласования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_СогласованиеСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;   

	ИдетифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Ссылка));  

	УстановитьПараметрыФункциональныхОпцийСогласования(Форма, ИдетифкаторОбъекта);
	
	Форма.Состояние = ПолучитьСостояниеОбъекта(Объект.Ссылка);

КонецПроцедуры  

Процедура ПриСозданииНаСервереФормыСписка(Форма, ИмяТипа,  Отказ, СтандартнаяОбработка) Экспорт
	
	ИдетифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип(ИмяТипа));  

	УстановитьПараметрыФункциональныхОпцийСогласования(Форма, ИдетифкаторОбъекта);

КонецПроцедуры

Процедура УстановитьПараметрыФункциональныхОпцийСогласования(Форма, ИдетифкаторОбъекта)
	
	УстанавливаемыеПараметры = новый Структура;
	УстанавливаемыеПараметры.Вставить("CW_ОбъектСогласования", ИдетифкаторОбъекта);
	
	Форма.УстановитьПараметрыФункциональныхОпцийФормы(УстанавливаемыеПараметры);

КонецПроцедуры

Функция ПолучитьСостояниеОбъекта(Ссылка) Экспорт
	
	 Возврат РегистрыСведений.CW_СостояниеСогласованияОбъекта.ПолучитьСостояниеОбъекта(Ссылка);
	 
 КонецФункции
 
Процедура ЗавершитьСогласование(Объект) ЭКспорт
	
	ПараметрыОповещения = ПолучитьПараметрыОповещения();
	
	Если ПараметрыОповещения.ОповещатьЧерезСистемуВзаимодействия Тогда
		CW_СистемаВзаимодействия.УдалитьОбсуждение(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

//Объект - эатп согласования
Процедура ОповеститьПользователейПоСогласованию(Объект, ОповеститьПользователей = Ложь, ОповеститьИнициатора = Ложь) Экспорт
	
	МассивСогласования  = ПолучитьОчередноеСогласование(Объект);
 	ЗаголовокОповещения = ПолучитьЗаголовокОповещения(Объект);
	ПараметрыОповещения = ПолучитьПараметрыОповещения();

	мИнициатор  = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Инициатор);
	мПолучатели = ПолучитьПолучателейОповещенияСогласования(Объект, МассивСогласования);
	
	УведомитьИнициатора = ПараметрыОповещения.УведомитьИнициатора и ОповеститьИнициатора;  
	
	Если ПараметрыОповещения.ОповещатьЧерезЦентрОповещений Тогда
		
		МассивОповещений = Новый Массив;
		
		Если ОповеститьПользователей Тогда
			Для Каждого Пользователь из мПолучатели Цикл
				ДанныеОпвещения = Новый Структура;
				ДанныеОпвещения.Вставить("Пользователь", 		Пользователь);
				ДанныеОпвещения.Вставить("Объект",  			Объект.ОбъектСогласования); 
				ДанныеОпвещения.Вставить("ЗаголовокОповещения", ЗаголовокОповещения);
				ДанныеОпвещения.Вставить("ТекстОповещения", 	"Вам направлен на согласование документ:"+Символы.ПС+Строка(Объект.ОбъектСогласования));;
				
				МассивОповещений.Добавить(ДанныеОпвещения);
			КонецЦикла;
		КонецЕсли;
		
		Если УведомитьИнициатора Тогда
			ДанныеОпвещения = Новый Структура;
			ДанныеОпвещения.Вставить("Пользователь",		Объект.Инициатор);
			ДанныеОпвещения.Вставить("Объект",  			Объект.ОбъектСогласования); 
			ДанныеОпвещения.Вставить("ЗаголовокОповещения",	ЗаголовокОповещения);
			ДанныеОпвещения.Вставить("ТекстОповещения",		"Документ:"+ Символы.ПС+Строка(Объект.ОбъектСогласования)+ Символы.ПС + Строка(Объект.СостояниеСогласования));
			
			МассивОповещений.Добавить(ДанныеОпвещения);
		КонецЕсли;
		
		РегистрыСведений.CW_ОповещенияКОтправке.ЗарегистрироватьОповещениеКОтправке(МассивОповещений);
		
	КонецЕсли;
	
	Если ПараметрыОповещения.ОповещатьЧерезСистемуВзаимодействия Тогда
		
		мУчастники	= ПолучитьПолучателейУчастниковОбсужедния(Объект);
		
		Если ОповеститьПользователей Тогда
			
			мСообщения 	= ПолучитьСообщенияСогласования(мИнициатор, мПолучатели, Объект.СостояниеСогласования);
	
			ДанныеОбсуждения = Новый Структура;
			ДанныеОбсуждения.Вставить("ЗаголовокОбсуждения", 	ЗаголовокОповещения);
			ДанныеОбсуждения.Вставить("Участники",				мУчастники);
			ДанныеОбсуждения.Вставить("ОбъектОбсуждения",  		Объект.ОбъектСогласования); 
			ДанныеОбсуждения.Вставить("Сообщения",				мСообщения);
			
			CW_СистемаВзаимодействия.СоздатьОбсуждение(ДанныеОбсуждения);
			
		КонецЕсли;
		
		Если УведомитьИнициатора Тогда
			Сообщение = Новый Структура;
			Сообщение.Вставить("Автор", 			ПараметрыСеанса.ТекущийПользователь);
			Сообщение.Вставить("Получатели", 		мИнициатор);
			Сообщение.Вставить("ДанныеДействие",	"ОткрытьСсылку");
			Сообщение.Вставить("Текст", 			Строка(Объект.СостояниеСогласования));
			
			мСообщения = Новый Массив;
			мСообщения.Добавить(Сообщение);
			
			ДанныеОбсуждения = Новый Структура;
			ДанныеОбсуждения.Вставить("ЗаголовокОбсуждения", 	ЗаголовокОповещения);
			ДанныеОбсуждения.Вставить("Участники",				мУчастники);
			ДанныеОбсуждения.Вставить("ОбъектОбсуждения",  		Объект.ОбъектСогласования);    
			ДанныеОбсуждения.Вставить("Сообщения", 				мСообщения);
			
			CW_СистемаВзаимодействия.СоздатьОбсуждение(ДанныеОбсуждения);
		КонецЕсли;
		
	КонецЕсли;
	
	//Подсистема.CW_РаботаСЭлектроннойПочтой
	Если ПараметрыОповещения.ОповещатьПоЭлектроннойПочте Тогда
		
		УчетнаяЗапись = CW_РаботаСЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПисемНаСогласование();
		Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			ТекстСообщения = "Для отправки письма требуется настройка учетной записи электронной почты для отправки писем на согласование.
			|Обратитесь к администратору.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Ответ = Новый Структура;
		Ответ.Вставить("КоличствоПисем", Неопределено);
		АдресРезультата = ПоместитьВоВременноеХранилище(Ответ, Новый УникальныйИдентификатор);
		
		ПарамептрыФоновогоЗадания = Новый Массив;
		ПарамептрыФоновогоЗадания.Добавить(Объект.Ссылка);
		ПарамептрыФоновогоЗадания.Добавить(мПолучатели);
		ПарамептрыФоновогоЗадания.Добавить(Объект.Инициатор);
		ПарамептрыФоновогоЗадания.Добавить(ОповеститьПользователей);
		ПарамептрыФоновогоЗадания.Добавить(УведомитьИнициатора);
		ПарамептрыФоновогоЗадания.Добавить(УчетнаяЗапись);
		ПарамептрыФоновогоЗадания.Добавить(АдресРезультата);
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("CW_Согласование.УведомитьОСобытииСогласования", ПарамептрыФоновогоЗадания,, "Соглавование.Уведомление по электронной почте.");
		
		Задание = ФоновоеЗадание.ОжидатьЗавершенияВыполнения(5);
		Пока Задание.Состояние = СостояниеФоновогоЗадания.Активно Цикл
			Задание = Задание.ОжидатьЗавершенияВыполнения(5);
		КонецЦикла;
		
		Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Ответ = ПолучитьИзВременногоХранилища(АдресРезультата);
			Если Ответ <> Неопределено Тогда
				Если Ответ.ЕстьОшибочныеПолучатели Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отправить сообщения одному или нескольким получателям! Подробнее см. в журнале регистрации!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	//Подсистема.CW_РаботаСЭлектроннойПочтой
	

КонецПроцедуры       

Функция ПолучитьЗаголовокОповещения(ЭтапСогласования)
	
	ОжидаетСогласования  = Новый Структура("ОжидаетСогласования", Истина);
	мОжидаетСогласования = ЭтапСогласования.МаршрутСогласования.НайтиСтроки(ОжидаетСогласования);
	Если мОжидаетСогласования.Количество() > 0 Тогда
		//Еще не все согласованили
		Возврат "Согласование документа";
	КонецЕсли;
	
	Отклонено  = Новый Структура("Событие", ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.Отклонено"));
	мОтклонено = ЭтапСогласования.МаршрутСогласования.НайтиСтроки(Отклонено);
	Если мОтклонено.Количество() > 0 Тогда
		Возврат "Документ отклонен";
	КонецЕсли;
	
	Возврат "Документ согласован";
	
КонецФункции

Функция ПолучитьОчередноеСогласование(ЭтапСогласования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ //ПЕРВЫЕ
				   |	МаршрутСогласования.НомерСтроки КАК НомерСтроки,
	               |	МаршрутСогласования.ГруппаСогласования КАК ГруппаСогласования
	               |ИЗ
	               |	Справочник.CW_ЭтапыСогласования.МаршрутСогласования КАК МаршрутСогласования
	               |ГДЕ
	               |	МаршрутСогласования.Ссылка = &ЭтапСогласования
	               |	И МаршрутСогласования.ОжидаетСогласования = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Если ЭтапСогласования.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПЕРВЫЕ", "ПЕРВЫЕ 1");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭтапСогласования", ЭтапСогласования);
	
	МассивСогласования = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСогласования.Добавить(Выборка.ГруппаСогласования);
	КонецЦикла;
	
	МассивСогласования.Добавить(ПредопределенноеЗначение("Справочник.CW_ГруппыСогласования.ПустаяСсылка"));
	
	Возврат МассивСогласования;

КонецФункции

Функция ПолучитьСообщенияСогласования(Знач мИнициатор, Знач мПолучатели, Знач ОбъектСостояние)
	
	мСообщения = Новый Массив;
	
	Если ОбъектСостояние = ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.НаСогласовании") Тогда
		Сообщение = Новый Структура;
		Сообщение.Вставить("Автор", 			мИнициатор[0]);
		Сообщение.Вставить("Получатели", 		мПолучатели);
		Сообщение.Вставить("ДанныеДействие",	"ОткрытьСсылку");
		Сообщение.Вставить("Текст", 			"Документ направлен Вам на согласование");
		
		мСообщения.Добавить(Сообщение);
	КонецЕсли;
	
	Возврат мСообщения;

КонецФункции

Функция ПолучитьПолучателейОповещенияСогласования(Объект, мГруппыСогласовнаия)
	
	Результат 	= новый Массив;
	
	Для Каждого ГруппаСогласования из мГруппыСогласовнаия Цикл
		
		Если Не ЗначениеЗаполнено(ГруппаСогласования) Тогда
			Продолжить;
		КонецЕсли;
		
		мСтроки = Объект.МаршрутСогласования.НайтиСтроки(Новый Структура("ГруппаСогласования", ГруппаСогласования)); 
		Для Каждого СтрокаТаблицы из мСтроки Цикл
			Если Результат.Найти(СтрокаТаблицы.Пользователь) = Неопределено Тогда
				Результат.Добавить(СтрокаТаблицы.Пользователь);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

Функция ПолучитьПолучателейУчастниковОбсужедния(Объект)
	
	Результат 	= Новый Массив;
	
	Для Каждого СтрокаТаблицы из Объект.МаршрутСогласования Цикл
		Если Результат.Найти(СтрокаТаблицы.Пользователь) = Неопределено Тогда
			Результат.Добавить(СтрокаТаблицы.Пользователь);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Добавить(Объект.Инициатор);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивОповещенийКОтправке() Экспорт
	
	Возврат РегистрыСведений.CW_ОповещенияКОтправке.ПолучитьМассивОповещенийКОтправке();
	
КонецФункции

Функция ПолучитьПараметрыОповещения() Экспорт
	
	ОповещатьЧерезСистемуВзаимодействия =  Константы.CW_ОповещатьЧерезСистемуВзаимодействия.Получить() и СистемаВзаимодействия.ИспользованиеДоступно();
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОповещатьПоЭлектроннойПочте", 		Константы.CW_ОповещатьПоЭлектроннойПочте.Получить());
	ПараметрыОповещения.Вставить("ОповещатьЧерезСистемуВзаимодействия", ОповещатьЧерезСистемуВзаимодействия);
	ПараметрыОповещения.Вставить("ОповещатьЧерезЦентрОповещений", 		Константы.CW_ОповещатьЧерезЦентрОповещений.Получить());
	ПараметрыОповещения.Вставить("УведомитьИнициатора", 				Константы.CW_УведомлятьИнициатораОСобытияхСогласования.Получить());
	
	Возврат ПараметрыОповещения;            
	
КонецФункции
